// const allQuestions_6
const allQuestions_6 = [
    // 1
    {
        question: "Що називають механічним рухом?",
        answers: [
            "Зміну положення тіла відносно інших тіл з часом",
            "Зміну швидкості тіла під дією сили",
            "Початок руху тіла внаслідок прикладання сили",
            "Зміну енергії тіла під час руху"
        ],
        correct: 0
    },
    {
        question: "Автомобіль рухається зі швидкістю 90 км/год. Визначте, який шлях він пройде за 40 секунд.",
        answers: [
            "250м",
            "300м",
            "510м",
            "1км"
        ],
        correct: 2
    },
    {
        question: "Виберіть, яка система відліку є інерціальною, а яка — неінерціальною для пасажира відносно автомобіля:\n1. Автомобіль рухається прямолінійно і рівномірно по дорозі.\n2. Автомобіль різко гальмує на дорозі.",
        answers: [
            "1 – інерціальна, 2 – неінерціальна",
            "1 – неінерціальна, 2 – інерціальна",
            "Обидві інерціальні",
            "Обидві неінерціальні"
        ],
        correct: 0
    },
    {
        question: "Поїзд рухається рівномірно і прямолінійно. Пасажир сидить у потязі, що відходить від платформи. Відносно кого пасажир рухається, а відносно кого він нерухомий?",
        answers: [
            "Відносно поїзда — нерухомий, відносно платформи — нерухомий",
            "Відносно поїзда — рухається, відносно платформи — рухається",
            "Відносно поїзда — рухається, відносно платформи — нерухомий",
            "Відносно поїзда — нерухомий, відносно платформи — рухається"
        ],
        correct: 3
    },
    {
        question: "Що називають матеріальною точкою?",
        answers: [
            "Тіло, що рухається рівномірно",
            "Тіло, розмірами якого можна знехтувати",
            "Будь-яке тіло у космосі",
            "Тіло, що рухається по прямій"
        ],
        correct: 1
    },
    {
        question: "Що називають траєкторією руху матеріальної точки?",
        answers: [
            "Вектор від початку до кінця руху",
            "Довжину шляху, пройденого тілом",
            "Лінію, яку описує точка під час руху",
            "Напрямок руху"
        ],
        correct: 2
    },
    {
        question: "Яка різниця між шляхом і переміщенням?",
        answers: [
            "Шлях — вектор, переміщення — скаляр",
            "Шлях — довжина траєкторії, переміщення — вектор від початку до кінця",
            "Шлях і переміщення — одне й те саме",
            "Шлях — це час руху, переміщення — швидкість"
        ],
        correct: 1
    },
    {
        question: "Дівчина йде по палубі лайнера, що відчалює. Як визначити швидкість дівчини відносно землі?",
        answers: [
            "Врахувати лише швидкість тіла всередині об’єкта",
            "Відняти швидкість дівчини від швидкості лайнера",
            "Скласти швидкість дівчини та швидкість лайнера",
            "Прийняти швидкість дівчини відносно землі рівною швидкості лайнеру, що відчалює"
        ],
        correct: 2
    },
    {
        question: "Що описує швидкість тіла?",
        answers: [
            "Як змінюється положення тіла за одиницю часу і в якому напрямку",
            "Довжину шляху, пройденого тілом",
            "Час, який тіло витрачає на рух",
            "Силу, що діє на тіло"
        ],
        correct: 0
    },
    {
        question: "Що відбувається зі швидкістю тіла при криволінійному нерівномірному русі?",
        answers: [
            "Швидкість залишається сталою за величиною і напрямком",
            "Швидкість змінюється за величиною, але залишається сталою за напрямком",
            "Швидкість змінюється як за величиною, так і за напрямком",
            "Швидкість залишається сталою за напрямком, але змінюється на величиною"
        ],
        correct: 2
    },
    {
        question: "Чим середня швидкість відрізняється від миттєвої швидкості?",
        answers: [
            "Середня швидкість визначається за весь проміжок часу, а миттєва — у конкретний момент",
            "Середня швидкість показує напрямок руху, миттєва — ні",
            "Миттєва швидкість завжди більша за середню",
            "Середня швидкість враховує криволінійність траєкторії, миттєва — ні"
        ],
        correct: 0
    },
    {
        question: "Що характеризує рівномірний рух тіла?",
        answers: [
            "Тіло рухається прямолінійно зі сталим прискоренням",
            "Швидкість тіла постійна за величиною і напрямком",
            "Швидкість змінюється лише за величиною",
            "Тіло рухається криволінійно"
        ],
        correct: 1
    },
    {
        question: "Що характеризує рівноприскорений рух тіла?",
        answers: [
            "Швидкість тіла постійна за величиною і напрямком",
            "Тіло не змінює свого положення",
            "Тіло рухається криволінійно, без прискорення",
            "Тіло рухається прямолінійно зі сталим прискоренням"
        ],
        correct: 3
    },
    {
    question: "Автомобіль почав рухатися з місця рівноприскорено і через 5 секунд його швидкість стала 20 м/с. Яке прискорення автомобіля?",
    answers: [
        "4 м/с²",
        "5 м/с²",
        "2 м/с²",
        "10 м/с²"
    ],
    correct: 0
    },
    {
        question: "Що відбувається зі швидкістю тіла при рівномірному русі по колу?",
        answers: [
            "Швидкість залишається сталою за величиною і напрямком",
            "Швидкість змінюється за величиною, але напрямок постійний",
            "Швидкість змінюється за напрямком, але величина стала",
            "Швидкість змінюється і за величиною, і за напрямком"
        ],
        correct: 2
    },
    {
        question: "Що показує період коливального або обертального руху?",
        answers: [
            "Відстань, пройдену тілом",
            "Кількість обертів або коливань за секунду",
            "Величину швидкості руху",
            "Час, за який тіло здійснює одне повне коло або коливання"
        ],
        correct: 3
    },
    {
        question: "Що показує частота коливального або обертального руху?",
        answers: [
            "Відстань, пройдену тілом",
            "Кількість обертів або коливань за секунду",
            "Величину швидкості руху",
            "Час, за який тіло здійснює одне повне коло або коливання"
        ],
        correct: 1
    },
    {
        question: "Тіло рухається по колу. Яка різниця між лінійною та кутовою швидкістю?",
        answers: [
            "Лінійна швидкість показує, яку відстань тіло проходить за одиницю часу, а кутова — на який кут обертається тіло за одиницю часу",
            "Лінійна швидкість показує, на який кут обертається тіло за одиницю часу, а кутова — яку відстань тіло проходить за одиницю часу",
            "Кутова швидкість змінюється з часом, а лінійна – завжди стала величина",
            "Лінійна швидкість змінюється з часом, а кутова – завжди стала величина"
        ],
        correct: 0
    },
    {
        question: "Що таке центростремне (доцентрове) прискорення?",
        answers: [
            "Прискорення, яке змінює величину швидкості тіла",
            "Прискорення, спрямоване вздовж дотичної до траєкторії",
            "Прискорення, спрямоване від центру кола при русі по колу",
            "Прискорення, спрямоване до центру кола при русі по колу"
        ],
        correct: 3
    },
    {
        question: "Який із наведених варіантів є першим законом Ньютона?",
        answers: [
            "Тіло зберігає стан спокою або рівномірного прямолінійного руху, якщо на нього не діють зовнішні сили.",
            "Прискорення тіла прямо пропорційне силі і обернено пропорційне масі.",
            "Для кожної дії існує рівна і протилежна протидія.",
            "Сила тяжіння між двома тілами прямо пропорційна їхнім масам і обернено пропорційна квадрату відстані між ними."
        ],
        correct: 0
    },
    {
    question: "Який із наведених варіантів є другим законом Ньютона?",
    answers: [
        "Тіло зберігає стан спокою або рівномірного прямолінійного руху, якщо на нього не діють зовнішні сили.",
        "Прискорення тіла прямо пропорційне силі і обернено пропорційне масі.",
        "Для кожної дії існує рівна і протилежна протидія.",
        "Сила тяжіння між двома тілами прямо пропорційна їхнім масам і обернено пропорційна квадрату відстані між ними."
    ],
    correct: 1
    },
    {
        question: "Який із наведених варіантів є третім законом Ньютона?",
        answers: [
            "Тіло зберігає стан спокою або рівномірного прямолінійного руху, якщо на нього не діють зовнішні сили.",
            "Прискорення тіла прямо пропорційне силі і обернено пропорційне масі.",
            "Для кожної дії існує рівна і протилежна протидія.",
            "Сила тяжіння між двома тілами прямо пропорційна їхнім масам і обернено пропорційна квадрату відстані між ними."
        ],
        correct: 2
    },
    {
        question: "Який із наведених варіантів є законом всесвітнього тяжіння?",
        answers: [
            "Тіло зберігає стан спокою або рівномірного прямолінійного руху, якщо на нього не діють зовнішні сили.",
            "Прискорення тіла прямо пропорційне силі і обернено пропорційне масі.",
            "Для кожної дії існує рівна і протилежна протидія.",
            "Сила тяжіння між двома тілами прямо пропорційна їхнім масам і обернено пропорційна квадрату відстані між ними."
        ],
        correct: 3
    },
    {
        question: "Що стверджує принцип відносності Галілея?",
        answers: [
            "Фізичні закони однакові у всіх інерціальних системах відліку.",
            "Сила тяжіння між двома тілами прямо пропорційна їхнім масам і обернено пропорційна квадрату відстані між ними.",
            "Для кожної дії існує рівна і протилежна протидія.",
            "Тіло завжди прагне залишатися у стані спокою."
        ],
        correct: 0
    },
    {
        question: "Що називають взаємодією тіл?",
        answers: [
            "Рух тіл відносно одне одного.",
            "Дію одного тіла на інше, унаслідок якої змінюється їхній стан руху.",
            "Дію одного тіла на інше, унаслідок якої змінюється їхній форма.",
            "Дію одного тіла на інше, унаслідок якої змінюється їхній стан руху та (або) форма."
        ],
        correct: 3
    },
    {
        question: "Що називається масою тіла?",
        answers: [
            "Швидкість, з якою рухається тіло.",
            "Величину, що визначає міру інертності тіла.",
            "Кількість речовини в тілі.",
            "Силу, з якою тіло притягується до Землі."
        ],
        correct: 1
    },
    {
        question: "Що називають силою?",
        answers: [
            "Міру кількості речовини в тілі.",
            "Характеристику розміру тіла.",
            "Міру взаємодії тіл.",
            "Енергію, яку має тіло під час руху."
        ],
        correct: 2
    },
    {
        question: "На тіло діють дві сили: 7 Н праворуч і 4 Н ліворуч. Яка рівнодійна цих сил?",
        answers: [
            "11 Н",
            "7 Н",
            "3 Н",
            "28 Н"
        ],
        correct: 2
    },
    {
        question: "Що таке гравітаційна сила?",
        answers: [
            "Сила, що діє при контакті двох тіл",
            "Сила, яка змінює форму тіла під дією іншого тіла",
            "Сила притягання тіл одне до одного, що залежить від їхніх мас і відстані між ними",
            "Сила, що діє на тіло, яке рухається у середовищі"
        ],
        correct: 2
    },
    {
        question: "Вага тіла – це:",
        answers: [
            "Сила, з якою тіло тисне на опору або підвіс",
            "Сила, яка змінює форму тіла під дією іншого тіла",
            "Сила, що діє на тіло, яке рухається у середовищі",
            "Сила притягання тіл одне до одного"
        ],
        correct: 0
    },
    {
        question: "Невагомість – це:",
        answers: [
            "Стан тіла, коли на нього зовсім не діє гравітація",
            "Стан тіла, коли воно не має маси",
            "Стан, коли вага тіла зрівноважена і воно не відчуває власної ваги",
            "Стан тіла, коли воно повністю нерухоме"
        ],
        correct: 2
    },
    {
        question: "Що таке сила пружності?",
        answers: [
            "Це сила, що виникає при контакті тіл",
            "Це сила, що змінює швидкість тіла під дією іншого тіла",
            "Це сила, з якою тіло тисне на опору або підвіс",
            "Це сила, що виникає при деформації тіла і прагне відновити його форму"
        ],
        correct: 3
    },
    {
        question: "Що таке сила тертя?",
        answers: [
            "Сила притягання тіл одне до одного",
            "Сила, що виникає між поверхнями тіл під час їх взаємного руху або спроби руху",
            "Сила, з якою тіло тисне на опору або підвіс",
            "Сила, що виникає при деформації тіла"
        ],
        correct: 1
    },
    {
        question: "За яких умов тіло залишатиметься в рівновазі?",
        answers: [
            "Лише за умови, коли на нього зовсім не діють сили",
            "За умови, коли всі сили, що діють на тіло, і моменти сил зрівноважені",
            "За умови, коли маса тіла велика",
            "За умови, коли тіло рухається з прискоренням"
        ],
        correct: 1
    },
    {
        question: "Що характеризує імпульс тіла?",
        answers: [
            "Маса і швидкість тіла",
            "Висота тіла відносно землі",
            "Об’єм і форма тіла",
            "Температура тіла"
        ],
        correct: 0
    },
    {
        question: "Що стверджує закон збереження імпульсу?",
        answers: [
            "Імпульс системи може змінюватися, якщо змінюється маса тіл",
            "Імпульс системи зростає зі збільшенням швидкості одного з тіл",
            "У замкненій системі сумарний імпульс тіл не змінюється",
            "Імпульс кожного тіла в системі завжди залишається сталим"
        ],
        correct: 2
    },
    {
        question: "Який принцип лежить в основі реактивного руху?",
        answers: [
            "Тіло рухається завдяки магнітним силам",
            "Тіло рухається, відштовхуючись або викидаючи масу в протилежному напрямку",
            "Тіло рухається завдяки тертю об поверхню",
            "Тіло рухається через гравітаційний вплив"
        ],
        correct: 1
    },
    {
        question: "Коли виконується механічна робота?",
        answers: [
            "Коли тіло стоїть на місці",
            "Коли тіло рухається, але на нього не діє сила",
            "Коли сила діє, але тіло не переміщується",
            "Коли на тіло діє сила і воно при цьому переміщується"
        ],
        correct: 3
    },
    {
        question: "Коли тіло має кінетичну та потенціальну енергію?",
        answers: [
            "Коли тіло стоїть на поверхні",
            "Коли тіло рухається по рівній поверхні",
            "Коли тіло рухається на висоті",
            "Коли тіло зависає у повітрі"
        ],
        correct: 2
    },
        {
        question: "Що говорить закон збереження енергії в механіці?",
        answers: [
            "Потенціальна енергія тіла завжди більша за кінетичну",
            "Кінетична енергія тіла завжди більша за потенціальну",
            "Загальна механічна енергія тіла залишається сталою, якщо тіло не зустрічає опору",
            "Загальна механічна енергія дорівнює різниці кінетичної та потенціальної енергії"
        ],
        correct: 2
    },
    {
        question: "При якому випадку потужність механічної роботи більша?",
        answers: [
            "Коли однакова робота виконується за більший час",
            "Коли менша робота виконується за більший час",
            "Коли однакова робота виконується за менший час",
            "Коли тіло стоїть на місці"
        ],
        correct: 2
    },
    {
        question: "Що показує коефііцієнт корисної дії?",
        answers: [
            "Відношення витраченої енергії до корисної роботи",
            "Відношення корисної роботи до витраченої енергії",
            "Швидкість виконання роботи",
            "Потужність пристрою, що виконує роботу"
        ],
        correct: 1
    },
    {
        question: "Що називають простим механізмом?",
        answers: [
            "Пристрій, який полегшує виконання роботи за рахунок зміни сили або напряму її дії",
            "Механізм, що автоматично виконує роботу без участі людини",
            "Пристрій, в якому рух і сила передаються від одного компонента до іншого",
            "Пристрій, який виконує комплексні завдання"
        ],
        correct: 0
    },
    {
        question: "Що показує тиск у фізиці?",
        answers: [
            "Кількість речовини в об’ємі",
            "Силу, яка діє на одиницю площі",
            "Силу, прикладену до тіла без врахування площі",
            "Енергію, витрачену на переміщення тіла"
        ],
        correct: 1
    },
    {
        question: "Що говорить закон Паскаля для рідин та газів?",
        answers: [
            "На тіло, занурене в рідину або газ, діє виштовхувальна сила",
            "Зовнішній тиск на рідину або газ передається рівномірно в усіх напрямках",
            "Тиск рідини зменшується при збільшенні її кількості",
            "Тиск рідини збільшується при збільшенні її кількості"
        ],
        correct: 1
    },
    {
        question: "Як змінюється атмосферний тиск з висотою?",
        answers: [
            "Змінюється тільки при вітрі",
            "Залишається однаковим на будь-якій висоті",
            "Збільшується з висотою",
            "Зменшується з висотою"
        ],
        correct: 3
    },
    {
        question: "Що стверджує закон Архімеда?",
        answers: [
            "На тіло, занурене в рідину або газ, діє виштовхувальна сила, що дорівнює вазі витісненої рідини або газу",
            "Зовнішній тиск на рідину або газ передається рівномірно",
            "Тиск рідини зменшується при збільшенні її кількості",
            "Тиск рідини збільшується при збільшенні її кількості"
        ],
        correct: 0
    },
    {
        question: "Від чого залежить тиск нерухомої рідини?",
        answers: [
            "Тільки від площі поверхні рідини",
            "Від густини рідини і форми посудини",
            "Від об’єму рідини і форми посудини",
            "Від густини рідини, глибини та прискорення вільного падіння"
        ],
        correct: 3
    },
    {
        question: "Коли тіло плаває в рідині?",
        answers: [
            "Коли вага тіла більша за вагу витісненої рідини",
            "Коли вага тіла дорівнює нулю",
            "Коли вага тіла дорівнює вазі витісненої рідини",
            "Коли на тіло не діє гравітація"
        ],
        correct: 2
    },
    {
        question: "Що вивчає механіка?",
        answers: [
            "Закони руху і взаємодії тіл",
            "Тільки рух тіл без сил",
            "Тільки взаємодію сил",
            "Взаємоперетворення теплової та механічної енергії"
        ],
        correct: 0
    },
    {
        question: "Що вивчає кінематика?",
        answers: [
            "Закони руху і взаємодії тіл",
            "Рух тіл без врахування сил",
            "Взаємозв’язок руху тіл з дією сил",
            "Перетворення енергії"
        ],
        correct: 1
    },
    {
        question: "Що вивчає динаміка?",
        answers: [
            "Закони руху і взаємодії тіл",
            "Рух тіл без врахування сил",
            "Взаємозв’язок руху тіл з дією сил",
            "Перетворення енергії"
        ],
        correct: 2
    },
    // 2
    {
        question: "Що є «будівельними» одиницями речовин?",
        answers: [
            "Атоми",
            "Молекули",
            "Іони",
            "Усі відповіді вірні"
        ],
        correct: 3
    },
    {
        question: "Який рух здійснюють частинки речовини?",
        answers: [
            "Безперервний рух",
            "Хаотичний рух",
            "Безперервний та хаотичний рух",
            "Частинки речовини є нерухомими"
        ],
        correct: 2
    },
    {
        question: "Які сили діють між частинками речовини?",
        answers: [
            "Між частинками речовини не діють жодні сили",
            "Між частинками речовини діють лише сили притягання",
            "Між частинками речовини діють сили притягання та відштовхування",
            "Між частинками речовини діють лише сили відштовхування"
        ],
        correct: 2
    },
    {
        question: "Від чого залежить середня кінетична енергія руху частинок речовини?",
        answers: [
            "Від маси речовини",
            "Від температури речовини",
            "Від об’єму, який займає речовина",
            "Усі відповіді вірні"
        ],
        correct: 1
    },
    {
        question: "Яке твердження про масу й розмір молекул є правильним?",
        answers: [
            "Молекули можна побачити неозброєним оком",
            "Усі молекули мають однакову масу і розмір",
            "Молекули неможливо побачити, їхня маса і розміри залежать від речовини",
            "Молекули неможливо побачити і вони не мають маси"
        ],
        correct: 2
    },
    {
        question: "Що таке стала Авогадро?",
        answers: [
            "Кількість атомів у 1 грамі речовини",
            "Кількість молекул у 1 молі речовини",
            "Кількість електронів у будь-якому атомі",
            "Кількість протонів у ядрі будь-якого атома"
        ],
        correct: 1
    },
    {
        question: "Яке число приблизно дорівнює сталій Авогадро?",
        answers: [
            "3,141·10²³",
            "6,022·10²³",
            "9,81·10²³",
            "1,60·10⁻¹⁹"
        ],
        correct: 1
    },
    {
        question: "Середня квадратична швидкість теплового руху молекул газу:",
        answers: [
            "Збільшується з підвищенням температури і зменшується при більшій масі молекули",
            "Залежить тільки від температури газу",
            "Залишається постійною при будь-якій температурі",
            "Збільшується з підвищенням температури, але не залежить від маси"
        ],
        correct: 0
    },
    {
        question: "Що називають ідеальним газом?",
        answers: [
            "Газ, молекули якого взаємодіють лише при зіткненнях і займають малий об’єм",
            "Газ, молекули якого не мають маси",
            "Газ, який не змінює тиск при зміні температури",
            "Газ, молекули якого не мають об’єму"
        ],
        correct: 0
    },
    {
        question: "Основне рівняння МКТ стверджує, що:",
        answers: [
            "Тиск газу не залежить від швидкості молекул",
            "Температура газу не впливає на енергію молекул",
            "Молекули газу перебувають у спокої",
            "Тиск газу пропорційний середній кінетичній енергії молекул"
        ],
        correct: 3
    },
    {
        question: "Температура речовини характеризує:",
        answers: [
            "Кількість молекул у речовині",
            "Середню кінетичну енергію молекул",
            "Молекулярну масу речовини",
            "Розмір молекул"
        ],
        correct: 1
    },
    {
        question: "Абсолютна шкала температур (Кельвіна) починається від:",
        answers: [
            "-273 °C",
            "0 °C",
            "100 °C",
            "273 °C"
        ],
        correct: 0
    },
    {
        question: "Рівняння стану ідеального газу описує зв’язок між:",
        answers: [
            "Тиском і масою газу",
            "Швидкістю молекул і температурою",
            "Тиском, об’ємом і температурою газу",
            "Молярною масою і енергією молекул"
        ],
        correct: 2
    },
    {
        question: "Ізопроцесом називають:",
        answers: [
            "Процес, коли маса молекул зменшується",
            "Процес, коли кількість молекул збільшується",
            "Процес зміни стану за постійного одного параметра",
            "Процес, коли температура і тиск завжди зростають"
        ],
        correct: 2
    },
    {
        question: "Тепловий рух молекул — це:",
        answers: [
            "Постійний хаотичний рух молекул",
            "Рух молекул тільки при зміні температури",
            "Рух молекул при сталої температурі",
            "Рух молекул у вакуумі"
        ],
        correct: 0
    },
    {
        question: "Кількість теплоти, переданої тілу, визначає:",
        answers: [
            "Скільки енергії тіло отримало при нагріванні",
            "Повну енергію руху тіла",
            "Енергію, яка не змінюється",
            "Енергію лише при плавленні"
        ],
        correct: 0
    },
    {
        question: "Питома теплоємність речовини — це:",
        answers: [
            "Кількість теплоти для нагрівання 1 кг на 1 °C",
            "Загальна енергія тіла",
            "Енергія при фазовому переході",
            "Температура початку нагрівання"
        ],
        correct: 0
    },
    {
        question: "Питома теплоємність речовини показує:",
        answers: [
            "Температуру початку нагрівання",
            "Скільки теплоти потрібно для нагрівання 1 кг на 1 °C",
            "Скільки теплоти виділяється при охолодженні",
            "Температуру після нагрівання"
        ],
        correct: 1
    },
    {
        question: "Перший закон термодинаміки встановлює, що:",
        answers: [
            "Тіло може створювати нову енергію",
            "Тіло завжди віддає більше енергії, ніж отримує",
            "Кількість теплоти витрачається на зміну внутрішньої енергії та роботу",
            "Під час теплопередачі внутрішня енергія не змінюється"
        ],
        correct: 2
    },
    {
        question: "Адіабатний процес — це процес, у якому:",
        answers: [
            "Газ змінює стан без зміни об’єму",
            "Газ змінює стан без теплообміну",
            "Газ нагрівається від зовнішнього середовища",
            "Газ охолоджується при постійному тиску"
        ],
        correct: 1
    },
    {
        question: "Принцип дії теплових двигунів ґрунтується на:",
        answers: [
            "Перетворенні всієї отриманої теплоти в роботу",
            "Перетворенні частини отриманої теплоти в механічну роботу",
            "Передачі всієї теплоти від гарячого тіла до холодного без виконання роботи",
            "Зміні внутрішньої енергії тіла без участі теплоти або роботи"
        ],
        correct: 1
    },
    {
        question: "Коефіцієнт корисної дії (ККД) теплового двигуна показує:",
        answers: [
            "Яку частину теплоти двигун віддає холодильнику",
            "Яку кількість палива двигун може спалити за певний час",
            "Скільки теплоти отримує двигун від нагрівача під час роботи",
            "Яку частину отриманої теплоти двигун перетворює в механічну роботу"
        ],
        correct: 3
    },
    {
        question: "Пароутворення — це процес:",
        answers: [
            "Перетворення рідини на газ при будь-якій температурі",
            "Викид пари лише під час нагрівання до 100 °C",
            "Зміни агрегатного стану газу на рідину",
            "Перетворення рідини на тверду речовину"
        ],
        correct: 0
    },
    {
        question: "У чому полягає основна різниця між випаровуванням і кипінням?",
        answers: [
            "Випаровування відбувається тільки при 100 °C, а кипіння — при будь-якій температурі",
            "Випаровування відбувається в об’ємі рідини, а кипіння — тільки на поверхні",
            "Кипіння відбувається повільно, а випаровування — дуже швидко",
            "Випаровування відбувається лише на поверхні рідини при будь-якій температурі, а кипіння — по всьому об’єму рідини при певній температурі"
        ],
        correct: 3
    },
    {
        question: "Конденсація — це процес:",
        answers: [
            "Процес охолодження газу або пари без зміни агрегатного стану",
            "Перетворення рідини на газ при будь-якій температурі",
            "Зменшення внутрішньої енергії тіла без зміни агрегатного стану",
            "Перетворення газу або пари на рідину або тверду речовину при охолодженні або підвищенні тиску"
        ],
        correct: 3
    },
    {
        question: "Питома теплота пароутворення — це:",
        answers: [
            "Кількість теплоти для нагрівання 1 кг рідини на 1 °C",
            "Загальна теплота, що виділяється під час конденсації всієї рідини",
            "Кількість теплоти для перетворення 1 кг рідини на пару без зміни температури",
            "Кількість теплоти, що потрібна для замерзання 1 кг рідини"
        ],
        correct: 2
    },
    {
        question: "Насичена та ненасичена пара відрізняються тим, що:",
        answers: [
            "Ненасичена пара перебуває у рівновазі з рідиною, насичена — не досягла максимальної концентрації",
            "Насичена пара перебуває у рівновазі з рідиною, ненасичена — не досягла максимальної концентрації і може додатково випаровувати рідину",
            "Ненасичена пара завжди має ту ж температуру, що й насичена",
            "Насичена пара містить менше молекул пари, ніж максимально можливо при даній температурі"
        ],
        correct: 1
    },
    {
        question: "Відносна вологість повітря — це:",
        answers: [
            "Відношення фактичної кількості водяної пари в повітрі до максимальної кількості при даній температурі, у відсотках",
            "Абсолютна кількість водяної пари в 1 м³ повітря",
            "Температура, при якій повітря насичується водяною парою",
            "Тиск водяної пари в повітрі незалежно від температури"
        ],
        correct: 0
    },
    {
        question: "Плавлення та тверднення — це процеси:",
        answers: [
            "Зміни агрегатного стану між твердим і рідким станом",
            "Зміни агрегатного стану між рідким і газоподібним станом",
            "Збільшення або зменшення внутрішньої енергії без зміни агрегатного стану",
            "Викид пари під час нагрівання"
        ],
        correct: 0
    },
    {
        question: "Питома теплота плавлення — це:",
        answers: [
            "Кількість теплоти для нагрівання 1 кг речовини на 1 °C",
            "Кількість теплоти, що виділяється при конденсації 1 кг пари",
            "Кількість теплоти для перетворення 1 кг рідини на пару",
            "Кількість теплоти для перетворення 1 кг твердого тіла на рідину без зміни температури"
        ],
        correct: 3
    },
    {
        question: "Що називають питомою теплотою згоряння палива?",
        answers: [
            "Кількість теплоти, що виділяється під час повного згоряння 1 кг палива",
            "Кількість теплоти для нагрівання 1 кг води на 1 °C",
            "Кількість енергії при неповному згорянні палива",
            "Температура, за якої паливо починає загорятися"
        ],
        correct: 0
    },
    {
        question: "Рівняння теплового балансу показує, що:",
        answers: [
            "При нагріванні тіла його внутрішня енергія завжди зростає",
            "У замкненій системі кількість теплоти, яку одні тіла отримують, дорівнює кількості теплоти, яку інші тіла втрачають",
            "Питома теплота плавлення для всіх речовин однакова",
            "Тіло не може охолоджуватися без виконання роботи"
        ],
        correct: 1
    },
    {
        question: "Поверхневий натяг рідин — це:",
        answers: [
            "Сила тиску, що діє на поверхню рідини",
            "Здатність рідини змінювати свій об’єм під дією зовнішньої сили",
            "Властивість поверхні рідини скорочуватися, мінімізуючи площу, через взаємодію молекул",
            "Явище, при якому рідина піднімається або опускається у капілярах"
        ],
        correct: 2
    },
    {
        question: "Сила поверхневого натягу — це:",
        answers: [
            "Сила, що діє на тіло, занурене в рідину",
            "Сила, з якою рідина тисне на стінки та дно посудини",
            "Сила, що виникає при зміні об’єму рідини під тиском",
            "Сила, що діє вздовж поверхні рідини і прагне зменшити її площу через взаємодію молекул"
        ],
        correct: 3
    },
    {
        question: "Змочування — це:",
        answers: [
            "Здатність рідини протидіяти збільшенню площі поверхні",
            "Явище піднімання або опускання рідини в капілярах через змочування",
            "Явище розтікання рідини по твердій поверхні через взаємодію молекул рідини та поверхні",
            "Процес переходу рідини в газоподібний стан при нагріванні"
        ],
        correct: 2
    },
    {
        question: "Що таке капілярні явища?",
        answers: [
            "Процес розчинення твердого тіла у рідині",
            "Розтікання рідини по твердій поверхні через взаємодію молекул",
            "Підняття або опускання рідини в тонких трубках через змочування і молекулярні сили",
            "Процес переходу рідини в газоподібний стан при нагріванні"
        ],
        correct: 2
    },
    {
        question: "Яка властивість характерна для кристалічних тіл?",
        answers: [
            "Температура плавлення невизначена",
            "Мають хаотичне розташування молекул",
            "Завжди прозорі або напівпрозорі",
            "Мають чітко визначену температуру плавлення через впорядковану структуру"
        ],
        correct: 3
    },
    {
        question: "Яка з речовин є прикладом аморфного тіла?",
        answers: [
            "Скло",
            "Алмаз",
            "Кухонна сіль",
            "Графіт"
        ],
        correct: 0
    },
    {
        question: "Що відноситься до механічних властивостей твердих тіл?",
        answers: [
            "Температура плавлення та кипіння",
            "Твердість, пружність, крихкість, пластичність",
            "Колір, твердість та прозорість",
            "Питома теплоємність та теплопровідність"
        ],
        correct: 1
    },
    {
        question: "Які види деформацій твердого тіла існують?",
        answers: [
            "Розтяг, стиск, зсув, вигин, кручення",
            "Плавлення, кипіння, конденсація",
            "Прозорість, колір, блиск",
            "Теплопровідність, теплоємність, розширення"
        ],
        correct: 0
    },
    {
        question: "Що характеризує молекулярно-кінетичну теорію?",
        answers: [
            "Тільки енергію пружності тіл",
            "Рух молекул і їх взаємодію, що пояснює температуру і тиск",
            "Властивості атомного ядра",
            "Електричні властивості речовин"
        ],
        correct: 1
    },
    {
        question: "Що вивчає молекулярна фізика та термодинаміка?",
        answers: [
            "Властивості речовин",
            "Рух та взаємодію молекул",
            "Явища, пов’язані з енергією, температурою і тиском",
            "Усі відповіді вірні"
        ],
        correct: 3
    },
    // 3
    {
        question: "Яке з наведених тверджень правильно описує електричний заряд?",
        answers: [
            "Електричний заряд — це сила, з якою одне тіло діє на інше",
            "Електричний заряд — це міра взаємодії тіл у гравітаційному полі",
            "Електричний заряд — це фізична величина, що визначає здатність частинок вступати в електромагнітну взаємодію",
            "Електричний заряд — це характеристика маси, що залежить від швидкості руху тіла"
        ],
        correct: 2
    },
    {
        question: "Як найточніше сформулювати закон збереження електричного заряду?",
        answers: [
            "Електричний заряд може виникати й зникати при терті тіл",
            "Сумарний електричний заряд замкненої системи залишається незмінним",
            "Електричний заряд зменшується під час передавання від одного тіла до іншого в замкненій системі",
            "Електричний заряд зберігається лише в провідниках, але не в діелектриках"
        ],
        correct: 1
    },
    {
        question: "Яке з тверджень найточніше формулює закон Кулона?",
        answers: [
            "Сила взаємодії між двома точковими зарядами прямо пропорційна сумі їхніх зарядів і обернено пропорційна квадрату відстані між ними",
            "Сила взаємодії між точковими зарядами не залежить від відстані між ними",
            "Сила взаємодії між двома точковими зарядами прямо пропорційна добутку їхніх зарядів і обернено пропорційна квадрату відстані між ними",
            "Сила взаємодії між зарядами в замкненій системі виникає лише тоді, коли вони рухаються"
        ],
        correct: 2
    },
    {
        question: "Що є правильним визначенням електричного поля?",
        answers: [
            "Електричне поле — це простір, у якому діє сила тяжіння між тілами",
            "Електричне поле — це вид механічної хвилі, що поширюється у просторі",
            "Електричне поле — це особливий вид матерії, що оточує заряджені тіла та проявляється через дію сил на інші заряди",
            "Електричне поле — це область, у якій електрони припиняють рух"
        ],
        correct: 2
    },
    {
        question: "Що таке напруженість електричного поля?",
        answers: [
            "Векторна фізична величина, яка дорівнює силі, що діє на одиничний позитивний пробний заряд, поміщений у дану точку поля",
            "Скалярна величина, яка дорівнює силі, що діє на одиничний позитивний пробний заряд, поміщений у дану точку поля",
            "Сила взаємодії між двома точковими зарядами прямо пропорційна добутку їхніх зарядів і обернено пропорційна квадрату відстані між ними",
            "Різниця потенціалів між двома точками"
        ],
        correct: 0
    },
    {
        question: "На столі лежить легка металева кулька. Попереду від кульки розташований позитивно заряджений стрижень, який притягує її вперед. Зліва знаходиться негативно заряджений стрижень. Сили однакові за величиною і діють одночасно. У якому напрямку почне рухатися кулька?",
        answers: [
            "Прямо вперед",
            "По діагоналі: вперед-вправо",
            "Прямо вправо",
            "Назад, у протилежний бік від обох стрижнів"
        ],
        correct: 1
    },
    {
        question: "Як поводяться провідники та діелектрики в електростатичному полі?",
        answers: [
            "У діелектриках заряди перерозподіляються, а в провідниках лише поляризуються",
            "У діелектриках заряди рухаються вільно, а у провідниках — майже нерухомі",
            "І в провідниках, і в діелектриках заряди поляризуються",
            "У провідниках заряди перерозподіляються, а в діелектриках лише поляризуються"
        ],
        correct: 3
    },
    {
        question: "Позитивний пробний заряд переміщують у електричному полі уздовж силових ліній у напрямку дії сили поля. Що можна сказати про роботу поля?",
        answers: [
            "Поле виконує додатну роботу",
            "Поле виконує нульову роботу",
            "Поле виконує від’ємну роботу",
            "Робота поля не залежить від напрямку переміщення"
        ],
        correct: 0
    },
    {
        question: "Що найкраще описує різницю потенціалів між двома точками електричного поля?",
        answers: [
            "Швидкість руху заряду між двома точками електричного поля",
            "Роботу, яку потрібно виконати, щоб перемістити одиничний позитивний заряд з однієї точки в іншу",
            "Відстань між двома точками електричного поля, в якому знаходяться заряди",
            "Силу, що діє на заряд у цих точках"
        ],
        correct: 1
    },
    {
        question: "Що таке напруга в електричному колі?",
        answers: [
            "Кількість електронів, які проходять через провідник за секунду",
            "Сила, за допомогою якої електрони пересуваються полем",
            "Потужність, що передається від джерела до споживача",
            "Фізична величина, що показує різницю потенціалів між двома точками кола"
        ],
        correct: 3
    },
    {
        question: "Як пов’язані напруга та напруженість в однорідному електричному полі?",
        answers: [
            "Напруга між двома точками більша, якщо напруженість поля більша або відстань між точками більша",
            "Напруга залежить лише від заряду, що переміщується",
            "Напруженість зростає тільки тоді, коли напруга падає",
            "Напруга і напруженість не мають фізичного зв’язку між собою"
        ],
        correct: 0
    },
    {
        question: "Що визначає електроємність провідника?",
        answers: [
            "Швидкість руху електронів у провіднику",
            "Максимальний струм, який може пройти через провідник",
            "Напруженість електричного поля біля поверхні провідника",
            "Здатність провідника накопичувати електричний заряд за певної різниці потенціалів"
        ],
        correct: 3
    },
    {
        question: "Що є головним призначенням конденсатора в електричному колі?",
        answers: [
            "Підсилення електричного струму",
            "Перетворення електричної енергії на теплову",
            "Накопичення та збереження електричного заряду і енергії",
            "Зменшення опору кола"
        ],
        correct: 2
    },
    {
        question: "Що найбільше впливає на електроємність плоского конденсатора?",
        answers: [
            "Площа пластин і відстань між ними",
            "Напруга, яку подають на конденсатор",
            "Матеріал проводів, що до нього під’єднані",
            "Відстань між пластинами і напруга, що подають на конденсатор"
        ],
        correct: 0
    },
    {
        question: "Як розподіляється напруга на конденсаторах при їх послідовному з’єднанні?",
        answers: [
            "На всіх конденсаторах напруга однакова",
            "Напруга зменшується із кожним наступним конденсатором",
            "Сумарна напруга ділиться між конденсаторами, і на кожному може бути різна напруга",
            "Напруга на кожному конденсаторі стає нескінченно великою"
        ],
        correct: 2
    },
    {
        question: "Де зосереджена енергія електричного поля у конденсаторі?",
        answers: [
            "На поверхні провідників",
            "У просторі між пластинами, де існує електричне поле",
            "Всередині джерела струму",
            "У проводах, що з’єднують пластини"
        ],
        correct: 1
    },
    {
        question: "Що таке електричний струм?",
        answers: [
            "Кількість електронів у провіднику",
            "Упорядкований напрямлений рух заряджених частинок",
            "Випадкове коливання електронів у провіднику",
            "Швидкість поширення світла в металі"
        ],
        correct: 1
    },
    {
        question: "Які умови необхідні для існування постійного електричного струму?",
        answers: [
            "Наявність джерела напруги й замкнутого кола",
            "Лише наявність великої кількості електронів",
            "Лише висока температура провідника",
            "Відсутність будь-якого опору в замкненому колі"
        ],
        correct: 0
    },
    {
        question: "Що показує сила струму в провіднику?",
        answers: [
            "Швидкість руху електронів",
            "Кількість електронів, що проходять за секунду",
            "Напругу в провіднику",
            "Скільки заряду проходить через провідник за певний час"
        ],
        correct: 3
    },
    {
        question: "Що встановлює закон Ома для ділянки кола?",
        answers: [
            "Залежність сили струму від напруги та опору",
            "Залежність опору від температури провідника",
            "Зв’язок між електроємністю та напругою",
            "Залежність сили струму від довжини провідника"
        ],
        correct: 0
    },
    {
        question: "Від чого залежить опір металевого провідника?",
        answers: [
            "Від матеріалу провідника",
            "Від довжини провідника",
            "Від площі поперечного перерізу провідника",
            "Усі варіанти вірні"
        ],
        correct: 3
    },
    {
        question: "Що визначає електрорушійна сила джерела струму (ЕРС)?",
        answers: [
            "Максимальну силу струму в колі",
            "Опір джерела струму",
            "Роботу, яку джерело виконує з перенесення одиниці заряду",
            "Кількість електронів у джерелі"
        ],
        correct: 2
    },
    {
        question: "Що визначає потужність електричного струму в колі?",
        answers: [
            "Швидкість руху електронів у колі",
            "Швидкість виконання роботи струмом у колі",
            "Кількість заряду в провіднику",
            "Температуру провідника"
        ],
        correct: 1
    },
    {
        question: "Що встановлює закон Джоуля–Ленца?",
        answers: [
            "Кількість теплоти, що виділяється в провіднику під час проходження струму",
            "Залежність напруги від довжини провідника",
            "Поширення електричного поля в просторі",
            "Властивості напівпровідників"
        ],
        correct: 0
    },
    {
        question: "Який носій заряду забезпечує електричний струм у металах?",
        answers: [
            "Позитивні йони (катіони)",
            "Протони",
            "Електрони",
            "Нейтрони"
        ],
        correct: 2
    },
    {
        question: "Що є основною причиною електронної провідності металів?",
        answers: [
            "Наявність вільних електронів у металічній решітці",
            "Рух позитивних іонів (катіонів)",
            "Поляризація атомів",
            "Наявність домішок у металах"
        ],
        correct: 0
    },
    {
        question: "Як змінюється електричний опір металу при підвищенні температури?",
        answers: [
            "Зменшується лінійно",
            "Не змінюється",
            "Зменшується експоненціально",
            "Збільшується"
        ],
        correct: 3
    },
    {
        question: "Що відбувається з електричним опором надпровідника при досягненні критичної температури?",
        answers: [
            "Зменшується поступово",
            "Стає рівним нулю",
            "Збільшується",
            "Залишається сталим"
        ],
        correct: 1
    },
    {
        question: "Хто є носіями електричного струму в електролітах?",
        answers: [
            "Електрони",
            "Йони",
            "Протони",
            "Нейтрони"
        ],
        correct: 1
    },
    {
        question: "Від чого залежить маса речовини, що виділяється на електроді під час електролізу?",
        answers: [
            "Від сили струму та часу його дії",
            "Лише від маси електрода",
            "Лише від температури розчину",
            "Лише від густини електроліту"
        ],
        correct: 0
    },
    {
        question: "У якому з наведених процесів використовується електроліз?",
        answers: [
            "Вимірювання електричного опору",
            "Генерування змінного струму",
            "Гальваностегія (нанесення металевих покриттів)",
            "Вимірювання густини розчину"
        ],
        correct: 2
    },
    {
        question: "Що є основними носіями електричного струму в газах?",
        answers: [
            "Нейтрони",
            "Фотони",
            "Металеві електрони",
            "Електрони та іони"
        ],
        correct: 3
    },
    {
        question: "Коли виникає самостійний газовий розряд?",
        answers: [
            "Коли іонізація газу підтримується самим розрядом, без зовнішнього джерела іонізації",
            "Лише при дуже високих температурах",
            "Лише у вакуумі",
            "Коли іонізацію газу спричиняє зовнішнє джерело іонізації"
        ],
        correct: 0
    },
    {
        question: "Що таке плазма?",
        answers: [
            "Іонізований газ, у якому є вільні електрони та йони",
            "Розчин електроліту",
            "Твердий провідник",
            "Нейтральний газ без заряджених частинок"
        ],
        correct: 0
    },
    {
        question: "Що є причиною появи струму у вакуумі між катодом і анодом?",
        answers: [
            "Розряд газу",
            "Перенесення іонів між катодом та анодом",
            "Емісія електронів з катода",
            "Рух нейтральних частинок"
        ],
        correct: 2
    },
    {
        question: "Хто є основними носіями струму в напівпровідниках?",
        answers: [
            "Лише електрони",
            "Електрони та дірки",
            "Лише іони",
            "Лише протони"
        ],
        correct: 1
    },
    {
        question: "Що є основною особливістю домішкової провідності напівпровідників?",
        answers: [
            "Не залежить від температури",
            "Зумовлена введенням атомів‐домішок, які збільшують кількість носіїв заряду",
            "Виникає лише при дуже високих температурах",
            "Домішкова провідність є слабшою за власну провідність напівпровідників"
        ],
        correct: 1
    },
    {
        question: "Як змінюється опір напівпровідника при підвищенні температури?",
        answers: [
            "Зростає",
            "Не змінюється",
            "Зменшується",
            "Спочатку зменшується, а потім різко зростає"
        ],
        correct: 2
    },
    {
        question: "Який напрямок прикладання напруги дозволяє струму легко проходити через p-n перехід?",
        answers: [
            "Зворотний",
            "Будь-який",
            "Нейтральний",
            "Прямий"
        ],
        correct: 3
    },
    {
        question: "Якою є основна функція напівпровідникового діода?",
        answers: [
            "Посилення сигналу",
            "Випрямлення змінного струму",
            "Збереження енергії",
            "Перетворення тепла в електрику"
        ],
        correct: 1
    },
    {
        question: "Для чого використовується біполярний транзистор у схемах?",
        answers: [
            "Як конденсатор",
            "Для посилення сигналу",
            "Як резистор",
            "Для випрямлення струму"
        ],
        correct: 1
    },
    {
        question: "Який ефект спостерігається між двома паралельними провідниками зі струмом?",
        answers: [
            "Провідники взаємно притягуються або відштовхуються",
            "Провідники розсіюють енергію",
            "Провідники стають ізоляторами",
            "Провідники змінюють свій хімічний склад"
        ],
        correct: 0
    },
    {
        question: "Якою величиною характеризується сила магнітного поля, що діє на провідник зі струмом?",
        answers: [
            "Потужністю",
            "Напруженістю магнітного поля",
            "Опором",
            "Енергією"
        ],
        correct: 1
    },
    {
        question: "Що вимірює вектор магнітної індукції?",
        answers: [
            "Температуру магнітного поля",
            "Швидкість електронів та їх напрямок",
            "Силу та напрямок магнітного поля",
            "Електричний заряд провідника"
        ],
        correct: 2
    },
    {
        question: "На що впливає сила Ампера?",
        answers: [
            "На швидкість електронів у вакуумі",
            "На потенціал провідника",
            "На провідник зі струмом у магнітному полі",
            "На теплове випромінювання провідника"
        ],
        correct: 2
    },
    {
        question: "Що визначає сила Лоренца?",
        answers: [
            "Силу тяжіння між зарядженими частинками",
            "Потужність електричного струму",
            "Дію магнітного поля на рухомий заряд",
            "Опір провідника"
        ],
        correct: 2
    },
    {
        question: "Що характеризує магнітна проникність матеріалу?",
        answers: [
            "Опір матеріалу",
            "Теплопровідність матеріалу",
            "Електропровідність матеріалу",
            "Здатність матеріалу пропускати магнітне поле"
        ],
        correct: 3
    },
    {
        question: "Яка властивість характерна для феромагнетиків?",
        answers: [
            "Не реагують на магнітне поле",
            "Слабко намагнічуються, здатні намагнічуватися лише у сильному полі",
            "Завжди мають нульову намагніченість",
            "Можуть сильно намагнічуватися і зберігати намагніченість"
        ],
        correct: 3
    },
    {
        question: "Що характеризує магнітний потік через поверхню?",
        answers: [
            "Напруженість електричного поля",
            "Сумарну дію магнітного поля на дану площу",
            "Енергію магнітного поля",
            "Напрямок електричного струму"
        ],
        correct: 1
    },
    {
        question: "Що описує явище електромагнітної індукції?",
        answers: [
            "Виникнення магнітного поля в провіднику при зміні електричного струму",
            "Виникнення електричного струму в провіднику при зміні магнітного поля",
            "Рух електронів у постійному магнітному полі",
            "Виникнення електричного поля у вакуумі"
        ],
        correct: 1
    },
    {
        question: "Як визначається індукована електрорушійна сила (ЕРС) у замкненому контурі?",
        answers: [
            "Прямо пропорційна площі контуру",
            "Пропорційна швидкості зміни магнітного потоку через контур",
            "Залежить лише від напруги джерела",
            "Рівна нулю у будь-якому випадку"
        ],
        correct: 1
    },
    {
        question: "Що встановлює правило Ленца?",
        answers: [
            "Напрямок індукованого струму завжди протилежний зміні магнітного потоку, що його викликала",
            "Величину індукованого струму, яка залежить від сили магнітного поля, що його викликала",
            "Залежність струму від опору провідника",
            "Кут нахилу магнітного поля"
        ],
        correct: 0
    },
    {
        question: "Явище самоіндукції проявляється у тому, що:",
        answers: [
            "Струм у колі не залежить від зміни магнітного поля",
            "Магнітне поле зникає миттєво після вимкнення струму",
            "Струм зростає миттєво до максимальної величини",
            "Зміна струму викликає індуковану ЕРС, яка протидіє зміні струму"
        ],
        correct: 3
    },
    {
        question: "Індуктивність електричного кола характеризує:",
        answers: [
            "Величину, що визначає опір провідника",
            "Здатність кола накопичувати електричний заряд",
            "Залежність струму від напруги джерела",
            "Здатність кола протидіяти зміні струму"
        ],
        correct: 3
    },
    {
        question: "Енергія магнітного поля індуктивності визначається як:",
        answers: [
            "Енергія, що зберігається у магнітному полі при проходженні струму",
            "Потужність, що витрачається на опір кола",
            "Робота джерела струму при постійному струмі",
            "Енергія, що виділяється у вигляді тепла"
        ],
        correct: 0
    },
    // 4
    {
        question: "Світлові та механічні хвилі можна вважати коливальним рухом, тому що:",
        answers: [
            "Вони поширюються лише в одному напрямку",
            "Їх швидкість не змінюється в будь-якому середовищі",
            "Вони періодично змінюють свої параметри, наприклад положення частинок",
            "Енергія хвиль не переноситься"
        ],
        correct: 2
    },
    {
        question: "Вільне гармонічне коливання характеризується тим, що:",
        answers: [
            "Тіло зупиняється після першого відхилення",
            "Тіло рухається періодично під дією сили, яка пропорційна його відхиленню",
            "Швидкість тіла залишається постійною",
            "Амплітуда коливань зростає з часом"
        ],
        correct: 1
    },
    {
        question: "Амплітуда гармонічного коливання визначає:",
        answers: [
            "Період коливань",
            "Частоту коливань",
            "Фазу коливання",
            "Максимальне відхилення тіла від положення рівноваги"
        ],
        correct: 3
    },
    {
        question: "Коливання вантажу на пружині характеризуються тим, що:",
        answers: [
            "Сила, що повертає вантаж у положення рівноваги, пропорційна його зміщенню",
            "Вантаж рухається рівномірно прямолінійно",
            "Амплітуда коливань збільшується з часом",
            "Період коливань залежить від швидкості руху вантажу"
        ],
        correct: 0
    },
    {
        question: "Період коливань нитяного маятника залежить від:",
        answers: [
            "Маси вантажу",
            "Довжини маятника та прискорення вільного падіння",
            "Амплітуди коливань",
            "Швидкості початкового відхилення"
        ],
        correct: 1
    },
    {
        question: "У системі, що виконує гармонічні коливання, у який момент повний запас енергії повністю зосереджений у потенціальній формі?",
        answers: [
            "Коли тіло проходить положення рівноваги",
            "Коли швидкість тіла найбільша",
            "Коли тіло знаходиться у точці найбільшого відхилення",
            "У будь-який момент часу, енергія не змінюється"
        ],
        correct: 2
    },
    {
        question: "Яка особливість є ключовою ознакою вимушених механічних коливань?",
        answers: [
            "Вони завжди мають однакову амплітуду",
            "Вони зникають одразу після припинення сили тертя",
            "Вони можливі лише у системах без опору",
            "Їх частота визначається частотою зовнішнього періодичного впливу"
        ],
        correct: 3
    },
    {
        question: "Якою є головна умова виникнення резонансу в механічній системі?",
        answers: [
            "Частота зовнішнього впливу збігається з власною частотою системи",
            "Амплітуда зовнішньої сили поступово зменшується",
            "Система перебуває у стані повного спокою",
            "Маса тіла більша за силу зовнішнього впливу"
        ],
        correct: 0
    },
    {
        question: "Що визначає швидкість поширення коливань у пружному середовищі?",
        answers: [
            "Тільки частота коливань",
            "Лише амплітуда коливань",
            "Початкова фаза джерела коливань",
            "Властивості самого середовища"
        ],
        correct: 3
    },
    {
        question: "Чим поперечні хвилі відрізняються від поздовжніх?",
        answers: [
            "У повздовжніх хвилях частинки коливаються перпендикулярно до напрямку поширення хвилі, а у поперечних ні",
            "У поперечних хвилях частинки коливаються перпендикулярно до напрямку поширення хвилі, а у повздовжніх ні",
            "У поперечних хвиль напрямок коливань завжди збігається з напрямком поширення хвилі, а у повздовжніх - ні",
            "У поперечних хвилях, навідміну від повздовжніх, немає перенесення енергії"
        ],
        correct: 1
    },
    {
        question: "Що називають довжиною хвилі?",
        answers: [
            "Відстань від джерела коливань до точки спостереження",
            "Відстань, на яку хвиля поширюється за один повний цикл коливань",
            "Різницю фаз між двома точками хвилі",
            "Найбільше відхилення частинки під час коливання"
        ],
        correct: 1
    },
    {
        question: "Звукова хвиля у повітрі є:",
        answers: [
            "Поперечною хвилею",
            "Електромагнітною хвилею",
            "Поздовжньою хвилею",
            "Хвилею, яка не переносить енергію"
        ],
        correct: 2
    },
    {
        question: "Від чого залежить швидкість звуку у газах?",
        answers: [
            "Від амплітуди коливань частинок",
            "Від початкової фази коливань",
            "Від частоти звукової хвилі",
            "Від пружності та густини газу"
        ],
        correct: 3
    },
    {
        question: "Гучність звуку визначається:",
        answers: [
            "Лише частотою звуку",
            "Інтенсивністю звукових коливань",
            "Довжиною звукової хвилі",
            "Лише відстанню до джерела звуку"
        ],
        correct: 1
    },
    {
        question: "Інфразвук і ультразвук відрізняються від звуку для людини тим, що:",
        answers: [
            "Вони завжди гучніші за нормальний звук",
            "Вони поширюються тільки у вакуумі",
            "Їх частота знаходиться відповідно нижче або вище діапазону сприйняття людським вухом",
            "Вони не передають енергію"
        ],
        correct: 2
    },
    {
        question: "Вільні електромагнітні коливання в коливальному контурі виникають тоді, коли:",
        answers: [
            "Контур підключено до постійного джерела напруги",
            "Через контур протікає постійний струм",
            "Коливання створюються зовнішньою періодичною силою",
            "Контур містить конденсатор і індуктивність, і струм може вільно змінюватися між ними"
        ],
        correct: 3
    },
    {
        question: "Під час коливань у коливальному контурі енергія:",
        answers: [
            "Постійно зберігається тільки у вигляді електричної енергії конденсатора",
            "Періодично переходить між електричною енергією конденсатора і магнітною енергією індуктивності",
            "Постійно зберігається тільки у вигляді магнітної енергії індуктивності",
            "Не змінюється ні в якій формі"
        ],
        correct: 1
    },
    {
        question: "Власна частота електромагнітних коливань в LC-контурі визначає:",
        answers: [
            "Частоту, з якою контур коливається самостійно без зовнішнього впливу",
            "Частоту, з якою контур коливається під дією зовнішніх сил",
            "Максимальну енергію магнітного поля індуктивності",
            "Напругу джерела струму"
        ],
        correct: 0
    },
    {
        question: "Вимушені електричні коливання в коливальному контурі виникають тоді, коли:",
        answers: [
            "У контурі відсутні втрати енергії",
            "На контур діє зовнішня періодична ЕРС",
            "Контур працює лише на своїй власній частоті без зовнішнього впливу",
            "Коливання відбуваються тільки за рахунок заряду конденсатора"
        ],
        correct: 1
    },
    {
        question: "Змінний електричний струм — це струм, у якому:",
        answers: [
            "Заряд рухається тільки в одному напрямку",
            "Напрямок струму змінюється із часом, а величина завжди залишається сталою",
            "Напруга не змінюється з часом",
            "Сила струму періодично змінюється за величиною і напрямком"
        ],
        correct: 3
    },
    {
        question: "Принцип роботи генератора змінного струму ґрунтується на:",
        answers: [
            "Нагріванні провідника, через який проходить струм",
            "Електромагнітній індукції — виникненні ЕРС під час обертання провідника в магнітному полі",
            "Постійній напрузі, що створює рівний струм",
            "Руху електронів лише в одному напрямку для стабільності роботи пристроїв постійного струму"
        ],
        correct: 1
    },
    {
        question: "Електричний резонанс у коливальному контурі виникає тоді, коли:",
        answers: [
            "Амплітуда коливань постійно зменшується",
            "Коливання струму повністю припиняються",
            "Частота зовнішнього джерела значно відрізняється від власної частоти контуру",
            "Частота зовнішнього джерела збігається з власною частотою контуру"
        ],
        correct: 3
    },
    {
        question: "Трансформатор працює на основі явища:",
        answers: [
            "Постійного струму в первинній обмотці",
            "Електромагнітної індукції — зміни магнітного потоку в сердечнику",
            "Нагрівання провідників під час проходження струму",
            "Руху електронів лише в одному напрямку для стабільності напруги"
        ],
        correct: 1
    },
    {
        question: "Електроенергію передають на великі відстані при високій напрузі, тому що:",
        answers: [
            "Висока напруга дозволяє зменшити силу струму і втрати енергії в проводах",
            "Висока напруга робить струм постійним, що необхідно для його передачі",
            "Висока напруга перешкоджає нагріванню трансформатора",
            "Висока напруга збільшує опір проводів"
        ],
        correct: 0
    },
    {
        question: "Що таке електромагнітне поле?",
        answers: [
            "Фізичне поле, яке створюють електричні заряди і струми",
            "Поле, яке існує тільки у вакуумі",
            "Поле, створене лише магнітами",
            "Високо іонізований газ"
        ],
        correct: 0
    },
    {
        question: "Яка швидкість поширення електромагнітних хвиль у вакуумі?",
        answers: [
            "0 м/с, тому що електромагнітні хвилі у вакуумі не поширюються",
            "Значення залежать від частот різних хвиль",
            "Наближена до швидкості світла",
            "Швидкість хвиль варіюється і залежить від напрямку поширення"
        ],
        correct: 2
    },
    {
        question: "Що таке шкала електромагнітних хвиль?",
        answers: [
            "Розподіл електромагнітних хвиль за довжиною та частотою",
            "Розподіл електромагнітних хвиль за кількістю електронів, що створюють хвилю",
            "Список усіх існуючих електромагнітних джерел",
            "Розподіл електромагнітних хвиль за їх швидкістю поширення у різних середовищах"
        ],
        correct: 0
    },
    {
        question: "Які властивості електромагнітного випромінювання залежать від діапазону?",
        answers: [
            "Кількість електронів у хвилі",
            "Сила тяжіння хвилі",
            "Проникна здатність і енергетичний вплив на речовину",
            "Колір електронів"
        ],
        correct: 2
    },
    {
        question: "При переході від радіохвиль до гамма-променів що відбувається з хвилями?",
        answers: [
            "Збільшується довжина хвилі і зменшується частота",
            "Зменшується довжина хвилі і збільшується частота",
            "Зменшується і довжина хвилі і частота",
            "Збільшується і довжина хвилі і частота"
        ],
        correct: 1
    },
    {
        question: "Чому світло поширюється прямолінійно в однорідному середовищі?",
        answers: [
            "Тому що показник заломлення всюди однаковий",
            "Тому що світло має постійний електричний заряд",
            "Тому що фотони уникають зіткнень з молекулами",
            "Тому що світло рухається повільніше за звук"
        ],
        correct: 0
    },
    {
        question: "Хто вперше досить точно визначив швидкість світла за допомогою зубчастого колеса?",
        answers: [
            "Іполіт Фізо",
            "Галілео Галілей",
            "Альберт Майкельсон",
            "Крістіан Гюйгенс"
        ],
        correct: 0
    },
    {
        question: "Який із наведених законів описує відбивання світла від ідеально дзеркальної поверхні?",
        answers: [
            "Промінь світла відбивається під випадковим кутом",
            "Кут відбивання дорівнює куту падіння",
            "Кут відбивання завжди є різницею 360° і кута падіння",
            "Промінь світла завжди заломлюється під кутом 90°"
        ],
        correct: 1
    },
    {
        question: "При переході світла з повітря у воду промінь:",
        answers: [
            "Завжди заломлюється під кутом 90°",
            "Змінює напрямок і відхиляється до нормалі",
            "Продовжує рухатися прямо, не змінюючи напрямку",
            "Відбивається назад у повітря"
        ],
        correct: 1
    },
    {
        question: "Що називають абсолютним показником заломлення середовища?",
        answers: [
            "Відношення швидкості світла у вакуумі до швидкості світла в іншому середовищі",
            "Відношення кута падіння до кута заломлення",
            "Відношення швидкості світла у вакуумі до швидкості світла в даному середовищі",
            "Відношення показників заломлення двох середовищ"
        ],
        correct: 2
    },
    {
        question: "Що таке лінза?",
        answers: [
            "Прилад для вимірювання швидкості світла",
            "Прозоре тіло з кривими поверхнями, що заломлює світло",
            "Дзеркало, яке відбиває світло",
            "Джерело світла"
        ],
        correct: 1
    },
    {
        question: "Що таке оптична сила лінзи?",
        answers: [
            "Зворотна величина фокусної відстані лінзи",
            "Здатність лінзи змінювати напрямок променів",
            "Максимальна яскравість лінзи",
            "Кількість світла, яке проходить через лінзу"
        ],
        correct: 0
    },
    {
        question: "Що таке інтерференція світла",
        answers: [
            "Це явище накладання двох або більше когерентних хвиль світла, що використовується у вимірюванні товщини плівок і в голографії",
            "Це відхилення світла на межі двох середовищ",
            "Це явище відбивання світла від шорстких поверхонь",
            "Це явище розпадання денного світла на складові кольори через різну швидкість проходження світла різної довжини хвилі у середовищі (наприклад, у склі або воді)"
        ],
        correct: 0
    },
    {
        question: "Що таке дифракція світла?",
        answers: [
            "Це відбивання світла від дзеркала",
            "Це огинання світлом країв перешкод або щілин, що призводить до огинання та інтерференції",
            "Це процес заломлення світла на межі двох середовищ",
            "Це явище розпадання денного світла на складові кольори через різну швидкість проходження світла різної довжини хвилі у середовищі"
        ],
        correct: 1
    },
    {
        question: "Для чого використовують дифракційні ґратки?",
        answers: [
            "Щоб відбивати світло назад у початкове середовище",
            "Щоб змінювати швидкість світла",
            "Щоб вимірювати товщину плівок",
            "Щоб визначати довжину хвилі світла та розкладати його на спектр"
        ],
        correct: 3
    },
    {
        question: "Що таке дисперсія світла?",
        answers: [
            "Розкладання білого світла на складові кольори",
            "Відбивання світла від дзеркала",
            "Огинання світлом країв перешкод або щілин",
            "Повне внутрішнє відбивання"
        ],
        correct: 0
    },
    {
        question: "Які типи спектрів світла існують?",
        answers: [
            "Неперервний і лінійчатий",
            "Відбивний і заломний",
            "Заломний і дифракційний",
            "Шорсткий і дзеркальний"
        ],
        correct: 0
    },
    {
        question: "Для чого використовують спектральний аналіз?",
        answers: [
            "Щоб вивчати інтенсивність і розподіл кольорів у світлі",
            "Щоб визначати фізичні властивості матеріалів, наприклад, густину",
            "Щоб визначати хімічний склад речовини за її спектром",
            "Щоб перевіряти правильність роботи оптичних приладів"
        ],
        correct: 2
    },
    {
        question: "Що таке поляризація світла?",
        answers: [
            "Заломлення світла на межі двох середовищ",
            "Впорядковане коливання електричного вектора світлової хвилі у певній площині",
            "Розкладання білого світла на складові кольори",
            "Процес заломлення світла на межі двох середовищ"
        ],
        correct: 1
    },
    {
        question: "Яке твердження правильно характеризує оптику як розділ фізики?",
        answers: [
            "Оптика вивчає дзеркала та лінзи, а також їх будову",
            "Оптика вивчає структуру, властивості та взаємодію атомних ядер, а також механізми ядерних реакцій",
            "Оптика вивчає властивості та взаємодію електромагнітного поля та електрично заряджених тіл",
            "Оптика вивчає світло, його властивості та явища поширення"
        ],
        correct: 3
    },
    {
        question: "Який розділ фізики займається вивченням періодичних процесів і поширенням у середовищах, включаючи звукові, механічні та електромагнітні явища?",
        answers: [
            "Термодинаміка",
            "Механіка коливань і хвиль",
            "Оптика",
            "Електродинаміка"
        ],
        correct: 1
    },
    // 5
    {
        question: "Який із наведених принципів є одним із постулатів спеціальної теорії відносності?",
        answers: [
            "Швидкість світла у вакуумі однакова для всіх інерціальних систем відліку",
            "Маса тіла завжди зменшується з ростом швидкості",
            "Час тече однаково для всіх спостерігачів",
            "Світло поширюється швидше в рухомих системах"
        ],
        correct: 0
    },
    {
        question: "Що є головною особливістю релятивістського додавання швидкостей?",
        answers: [
            "Швидкості тіл сумуються за формулами класичної механіки",
            "Результуюча швидкість ніколи не перевищує швидкість світла",
            "Сума швидкостей завжди більша за швидкість світла",
            "Формула додавання швидкостей справедлива лише для тіл із нульовою масою"
        ],
        correct: 1
    },
    {
        question: "Яка ідея лежить в основі взаємозв’язку маси й енергії?",
        answers: [
            "Енергія існує лише у вигляді кінетичної",
            "Енергія передається тільки хвилями",
            "Маса є формою енергії, вона може перетворитися в інші види енергії",
            "Тіла з нульовою масою не мають енергії при русі"
        ],
        correct: 2
    },
    {
        question: "Що запропонував Макс Планк у своїй гіпотезі?",
        answers: [
            "Світло завжди поширюється як хвиля",
            "Енергія випромінювання поглинається і випромінюється порціями (квантами)",
            "Фотон не має енергії при будь-якій частоті, адже його маса рівна нулю",
            "Формула додавання швидкостей справедлива лише для тіл із нульовою масою"
        ],
        correct: 1
    },
    {
        question: "Що визначає стала Планка?",
        answers: [
            "Максимальну енергію хвилі",
            "Мінімальну довжину хвилі світла",
            "Коефіцієнт, що зв’язує енергію кванта з частотою",
            "Швидкість фотона в вакуумі"
        ],
        correct: 2
    },
    {
        question: "Який опис відповідає фотону?",
        answers: [
            "Частинка з додатною масою, що рухається повільніше за світло",
            "Електромагнітна хвиля, що переносить енергію, але при цьому не має частинок",
            "Квант електромагнітного випромінювання, який переносить енергію і імпульс",
            "Частинка, що має масу спокою, і яка завжди рухається зі швидкістю світла"
        ],
        correct: 2
    },
    {
        question: "Що описує фотоефект?",
        answers: [
            "Викид електронів з поверхні металу під дією світла певної частоти",
            "Поширення світла як хвилі у вакуумі",
            "Явище відбиття світла від дзеркала",
            "Заломлення світла при розходженні через призму"
        ],
        correct: 0
    },
    {
        question: "Яке рівняння описує енергію електронів, що вилітають при фотоефекті?",
        answers: [
            "Ek = hν − A",
            "E = mc²",
            "λ = h/p",
            "v = λf"
        ],
        correct: 0
    },
    {
        question: "В якому із перерахованих варіантів застосовується явище фотоефекту?",
        answers: [
            "У відбитті світла від дзеркала",
            "У фотоелементах, сонячних панелях та датчиках світла",
            "У відбиванні радіохвиль від дна океану",
            "У механічних годинниках"
        ],
        correct: 1
    },
    {
        question: "Що таке тиск світла?",
        answers: [
            "Явище відбиття світла від дзеркальної поверхні",
            "Заломлення світла в прозорому середовищі",
            "Енергія, з якою рухаються частинки світла у вакуумі",
            "Сила, з якою світло діє на поверхню при поглинанні або відбитті"
        ],
        correct: 3
    },
    {
        question: "Що показав експеримент Резерфорда з α-частинками?",
        answers: [
            "Атоми мають однорідну структуру без порожнин",
            "Електрони закріплені на фіксованих позиціях навколо ядра",
            "Атом має щільне позитивно заряджене ядро, навколо якого рухаються електрони",
            "Вся маса атома розподілена рівномірно"
        ],
        correct: 2
    },
    {
        question: "Що характеризує ядерна модель атома?",
        answers: [
            "Електрони розташовані всередині ядра атома",
            "Атом однорідний, не має ядра",
            "Електрони рухаються навколо щільного позитивного ядра",
            "Маса атома розподілена рівномірно"
        ],
        correct: 2
    },
    {
        question: "Що пропонує модель Бора щодо руху електронів в атомі?",
        answers: [
            "Електрони можуть мати будь-яку енергію",
            "Електрони обертаються тільки по певних стаціонарних квантованих орбітах",
            "Електрони рухаються хаотично",
            "Електрони завжди залишаються нерухомими"
        ],
        correct: 1
    },
    {
        question: "Що відбувається, коли атом поглинає або випромінює світло?",
        answers: [
            "Електрон переходить між стаціонарними орбітами, змінюючи енергію атома",
            "Електрони переходять між орбітами без зміни енергії",
            "Маса ядра змінюється",
            "Ядро втрачає масу"
        ],
        correct: 0
    },
    {
        question: "Як утворюється лінійчастий спектр?",
        answers: [
            "Через неперервне нагрівання речовини",
            "Через відбивання світла",
            "Через перехід електронів між енергетичними рівнями атома",
            "Через змішування світлових джерел"
        ],
        correct: 2
    },
    {
        question: "Що таке лазер?",
        answers: [
            "Лінійно направлений неперервний спектр світла",
            "Поляризоване і розсіяне світло",
            "Когерентне випромінювання світла з вузьким спектром",
            "Промінь денного світла"
        ],
        correct: 2
    },
    {
        question: "З чого складається ядро атома?",
        answers: [
            "З електронів та нейтронів",
            "З протонів та електронів",
            "З нейтронів та електронів",
            "З протонів та нейтронів"
        ],
        correct: 3
    },
    {
        question: "Що таке ізотопи?",
        answers: [
            "Атоми з однаковою масою, але різним зарядом",
            "Атоми одного елемента з однаковим числом протонів, але різною кількістю нейтронів",
            "Атоми одного елемента з різною кількістю електронів",
            "Атоми лише радіоактивних елементів"
        ],
        correct: 1
    },
    {
        question: "Що таке енергія зв’язку ядра?",
        answers: [
            "Енергія, яка потрібна щоб розділити ядро на нуклони",
            "Енергія електронів",
            "Кінетична енергія атома",
            "Потенційна енергія фотонів"
        ],
        correct: 0
    },
    {
        question: "Що відбувається під час ядерної реакції?",
        answers: [
            "Електрони переходять між орбітами",
            "Маса атома повністю незмінна",
            "Атоми утворюють молекули",
            "Ядра атомів змінюються з виділенням або поглинанням енергії"
        ],
        correct: 3
    },
    {
        question: "Що відбувається під час поділу ядер урану?",
        answers: [
            "Електрони переходять між орбітами",
            "Атоми урану об’єднуються",
            "Ядра зливаються",
            "Ядро розпадається на два менші з виділенням енергії"
        ],
        correct: 3
    },
    {
        question: "Яка основна функція ядерного реактора?",
        answers: [
            "Використання фотонів",
            "Підтримка керованої ланцюгової реакції для отримання енергії",
            "Злиття ядер",
            "Створення електронів"
        ],
        correct: 1
    },
    {
        question: "Що відбувається під час термоядерної реакції?",
        answers: [
            "Розпад важких ядер",
            "Перехід електронів між орбітами",
            "Злиття легких ядер з виділенням великої енергії",
            "Лише радіоактивний розпад"
        ],
        correct: 2
    },
    {
        question: "Що таке радіоактивність?",
        answers: [
            "Самовільний розпад нестабільних ядер із виділенням енергії",
            "Перетворення електронів у нейтрони",
            "Випромінювання лише світла",
            "Взаємодія ядер із фотонами"
        ],
        correct: 0
    },
    {
        question: "Які частинки або промені виділяються при радіоактивному розпаді?",
        answers: [
            "Альфа-частинки та бета-частинки",
            "Нейтрони та протони",
            "Гамма-промені",
            "Альфа-, бета- частинки та гамма-промені"
        ],
        correct: 3
    },
    {
        question: "Як реєструють іонізуюче випромінювання?",
        answers: [
            "Лічильники Гейгера-Мюллера, сцинтиляційні детектори, фотоплівка",
            "Візуально спостерігаючи промені",
            "Термометром",
            "Використовуючи електронне поле"
        ],
        correct: 0
    },
    {
        question: "Що вивчає квантова фізика?",
        answers: [
            "Рух тіл за законами Ньютона",
            "Природу і властивості атомів, молекул та елементарних частинок",
            "Лише радіоактивні елементи",
            "Хімічні реакції без урахування структури атома"
        ],
        correct: 1
    }
];